; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-51)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 - object)
 (:init 
    (arm-empty)
    (clear b8)
    (on b8 b10)
    (on b10 b3)
    (on-table b3)
    (clear b9)
    (on b9 b15)
    (on b15 b13)
    (on b13 b6)
    (on b6 b1)
    (on b1 b7)
    (on b7 b12)
    (on b12 b11)
    (on b11 b5)
    (on b5 b2)
    (on b2 b4)
    (on-table b4)
    (clear b14)
    (on-table b14))
 (:goal (and 
(on-table b4)
(on-table b7)
(on b10 b7)
(on b12 b10)
(on b13 b4)
(on b1 b12)
))
)

; plan
1. (unstack b9 b15)
   deleted: (on b9 b15) (clear b9) (arm-empty)
   added: (holding b9) (clear b15)
   goals met: 1 of 6
2. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 1 of 6
3. (unstack b15 b13)
   deleted: (on b15 b13) (clear b15) (arm-empty)
   added: (holding b15) (clear b13)
   goals met: 1 of 6
4. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 1 of 6
5. (unstack b13 b6)
   deleted: (on b13 b6) (clear b13) (arm-empty)
   added: (holding b13) (clear b6)
   goals met: 1 of 6
6. (stack b13 b14)
   deleted: (clear b14) (holding b13)
   added: (arm-empty) (clear b13) (on b13 b14)
   goals met: 1 of 6
7. (unstack b6 b1)
   deleted: (on b6 b1) (clear b6) (arm-empty)
   added: (holding b6) (clear b1)
   goals met: 1 of 6
8. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 1 of 6
9. (unstack b1 b7)
   deleted: (on b1 b7) (clear b1) (arm-empty)
   added: (holding b1) (clear b7)
   goals met: 1 of 6
10. (stack b1 b15)
   deleted: (clear b15) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b15)
   goals met: 1 of 6
11. (unstack b7 b12)
   deleted: (on b7 b12) (clear b7) (arm-empty)
   added: (holding b7) (clear b12)
   goals met: 1 of 6
12. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 2 of 6
13. (unstack b8 b10)
   deleted: (on b8 b10) (clear b8) (arm-empty)
   added: (holding b8) (clear b10)
   goals met: 2 of 6
14. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 2 of 6
15. (unstack b10 b3)
   deleted: (on b10 b3) (clear b10) (arm-empty)
   added: (holding b10) (clear b3)
   goals met: 2 of 6
16. (stack b10 b7)
   deleted: (clear b7) (holding b10)
   added: (arm-empty) (clear b10) (on b10 b7)
   goals met: 3 of 6
17. (unstack b12 b11)
   deleted: (on b12 b11) (clear b12) (arm-empty)
   added: (holding b12) (clear b11)
   goals met: 3 of 6
18. (stack b12 b10)
   deleted: (clear b10) (holding b12)
   added: (arm-empty) (clear b12) (on b12 b10)
   goals met: 4 of 6
19. (unstack b1 b15)
   deleted: (on b1 b15) (clear b1) (arm-empty)
   added: (holding b1) (clear b15)
   goals met: 4 of 6
20. (stack b1 b12)
   deleted: (clear b12) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b12)
   goals met: 5 of 6
21. (unstack b11 b5)
   deleted: (on b11 b5) (clear b11) (arm-empty)
   added: (holding b11) (clear b5)
   goals met: 5 of 6
22. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 5 of 6
23. (unstack b5 b2)
   deleted: (on b5 b2) (clear b5) (arm-empty)
   added: (holding b5) (clear b2)
   goals met: 5 of 6
24. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 5 of 6
25. (unstack b2 b4)
   deleted: (on b2 b4) (clear b2) (arm-empty)
   added: (holding b2) (clear b4)
   goals met: 5 of 6
26. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 5 of 6
27. (unstack b13 b14)
   deleted: (on b13 b14) (clear b13) (arm-empty)
   added: (holding b13) (clear b14)
   goals met: 5 of 6
28. (stack b13 b4)
   deleted: (clear b4) (holding b13)
   added: (arm-empty) (clear b13) (on b13 b4)
   goals met: 6 of 6
